

start_without_username_and_password = '''Привіт я телеграм бот Flask Calendar📅!

Я призначений для перегляду вашого календаря та щоб отримувати сповіщення про події в календарі.

Ваш Логін: {}.
За допомогою команди /username ви можете встановити новий логін.
Використовуйте латинські літери, цифри та знаки пунктуації.
Логін не може містити пробіли.

⚠️Ваш пароль: {}
⚠️Не забувайте пароль!

Для того щоб переглянути всі доступні команди використовуйте команду /help.
Ця команда також покаже вам як відкрити ваш календар.'''


start_with_username = '''Привіт я телеграм бот Flask Calendar📅!

Я призначений для перегляду вашого календаря та щоб отримувати сповіщення про події в календарі.

Для того щоб переглянути всі доступні команди використовуйте команду /help.
Ця команда також покаже вам як відкрити ваш календар.'''


start_with_username_and_password = '''Привіт я телеграм бот Flask Calendar📅!

Я призначений для перегляду вашого календаря та щоб отримувати сповіщення про події в календарі.

Для того щоб переглянути всі доступні команди використовуйте команду /help.
Ця команда також покаже вам як відкрити ваш календар.

⚠️Ваш пароль: {}
⚠️Не забувайте пароль!'''


new_username_invalid = '''⚠️Використовуйте латинські літери, цифри та знаки пунктуації.
⚠️Логін має містити не менше 4 символів.'''


new_password_invalid = '''⚠️Використовуйте латинські літери, цифри та знаки пунктуації.
⚠️Логін не може містити пробіли.
⚠️Логін має містити не менше 4 символів.'''


help = '''Доступні команди:
/start - початок роботи бота
/help - показати цю справку
/username - встановити новий логін
/password - встановити новий пароль

Щоб потрапити на календар перейдіть за цим посиланням:
{}
Та вкражіть ваш логін та пароль.'''


TEXT = {
    'start_without_username_and_password': start_without_username_and_password,
    'start_with_username': start_with_username,
    'start_with_username_and_password': start_with_username_and_password,
    'new_username_invalid': new_username_invalid,
    'new_password_invalid': new_password_invalid,
    'help': help
}