

start_without_username_and_password = '''Привіт я телеграм бот Flask Calendar📅!

Я призначений для перегляду вашого календаря та щоб отримувати сповіщення про події в календарі.

Ваш Логін: {}.
За допомогою команди /username ви можете встановити новий логін.
Використовуйте латинські літери, цифри та знаки пунктуації.
Логін не може містити пробіли.

⚠️Ваш пароль: {}
⚠️Не забувайте пароль!

Для того щоб переглянути всі доступні команди використовуйте команду /help.
Ця команда також покаже вам як відкрити ваш календар.'''


start_with_username = '''Привіт я телеграм бот Flask Calendar📅!

Я призначений для перегляду вашого календаря та щоб отримувати сповіщення про події в календарі.

Для того щоб переглянути всі доступні команди використовуйте команду /help.
Ця команда також покаже вам як відкрити ваш календар.'''

start_with_username_and_password = '''Привіт я телеграм бот Flask Calendar📅!

Я призначений для перегляду вашого календаря та щоб отримувати сповіщення про події в календарі.

Для того щоб переглянути всі доступні команди використовуйте команду /help.
Ця команда також покаже вам як відкрити ваш календар.

⚠️Ваш пароль: {}
⚠️Не забувайте пароль!'''


TEXT = {
    'start_without_username_and_password': start_without_username_and_password,
    'start_with_username': start_with_username,
    'start_with_username_and_password': start_with_username_and_password
}